src/cf/src/Documents/ЗаданиеНаПересчет/ЗаданиеНаПересчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаПересчет</name>
  <attributes>
    <name>ПересчетТовара</name>
    <type>
      <types>DocumentRef.ПересчётТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРасчета</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ЗаданиеНаПересчет/Forms/ФормаДокументаМобильныйКлиент/Module.bsl
&НаКлиенте
Процедура Сканировать(Команда)
	#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаРаспознанногоШтрихкода", ЭтаФорма);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканируйте", ОбработчикСканирования,,ТипШтрихКода.Двухмерный);
		Иначе
			Сообщить(НСтр("fr = ""Numérisation de codes à barres n'est pas prise en charge !""; ru = 'Не поддерживается сканирование штрихкодов!'; en = 'Barcode scanning is not supported!'; es = '¡No se Admite el escaneo de códigos de barras!'"));
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРаспознанногоШтрихкода(Штрихкод, Результат, Сообщение, ДопПараметр) Экспорт 
	
	Если Результат Тогда
		Если ЗначениеЗаполнено(Штрихкод) Тогда 
			СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
			Если СтруктураТОвара = Неопределено Тогда 
				ПоказатьПредупреждение(,НСтр("fr = ""Produit n'est pas trouvé""; ru = 'Товар не найден'; en = 'Product not found'; es = 'Producto no encontrado'"));
				Возврат; 
			КонецЕсли;
			НС = Объект.ТЧТовары.Добавить();
			НС.Номенклатура = СтруктураТОвара.Номенклатура;
			Элементы.ТЧТовары.ТекущаяСтрока = НС.ПолучитьИдентификатор();
			ЭтаФорма.Модифицированность = Истина;
		Иначе
			ПоказатьПредупреждение(,НСтр("fr = ""Produit n'est pas trouvé""; ru = 'Товар не найден'; en = 'Product not found'; es = 'Producto no encontrado'"));
        КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Не ОтменаРедактирования Тогда
		Элемент.ТекущиеДанные.ДатаРасчета = ПолучитьДатуСеанса();
		//ЭтаФорма.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуСеанса()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	Если Не Элементы.ТЧТовары.ТекущиеДанные = Неопределено Тогда 
		СтруктураТоварПосчитан = ТоварУжеПосчитан(Элементы.ТЧТовары.ТекущиеДанные.Номенклатура);
		Если СтруктураТоварПосчитан.Посчитан Тогда
			ТекстПредупреждения = НСтр("ru = 'Товар уже посчитан пользователем '; fr = 'Le produit a déjà été compté par '");
			Для Каждого Эл из СтруктураТоварПосчитан.Значение Цикл
				ТекстПредупреждения = ТекстПредупреждения + Символы.ПС;
				ТекстПредупреждения = ТекстПредупреждения + Эл.Ответственный + " - " + Эл.ДатаРасчета + ". Qté "+ Эл.Количество;
			КонецЦикла;
			ПоказатьПредупреждение(,ТекстПредупреждения);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТоварУжеПосчитан(Товар)
	Структура = Новый Структура("Посчитан,Значение",Ложь,Новый Массив);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаПересчетТЧТовары.Номенклатура КАК Номенклатура,
	|	ЗаданиеНаПересчетТЧТовары.ДатаРасчета КАК ДатаРасчета,
	|	ЗаданиеНаПересчетТЧТовары.Ссылка.Ответственный КАК Ответственный,
	|	ЗаданиеНаПересчетТЧТовары.Количество КАК Количество
	|ИЗ
	|	Документ.ЗаданиеНаПересчет.ТЧТовары КАК ЗаданиеНаПересчетТЧТовары
	|ГДЕ
	|	ЗаданиеНаПересчетТЧТовары.Ссылка.ПересчетТовара = &ПересчетТовара
	|	И ЗаданиеНаПересчетТЧТовары.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("ПересчетТовара", Объект.ПересчетТовара);
	Запрос.УстановитьПараметр("Номенклатура", Товар);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Количество() = 0 Тогда
		Структура.Посчитан = Истина;
		Пока Выборка.Следующий() Цикл
			СтруктураЗначения = Новый Структура("Ответственный,ДатаРасчета, Количество",Неопределено,Неопределено, 0);
			СтруктураЗначения.Ответственный = Выборка.Ответственный;
			СтруктураЗначения.ДатаРасчета = Выборка.ДатаРасчета;
			СтруктураЗначения.Количество = Выборка.Количество;
			Структура.Значение.Добавить(СтруктураЗначения);
		КонецЦикла;
	КонецЕсли;
	Возврат Структура;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Объект.Ссылка.Пустая() и Объект.Дата < НачалоДня(ТекущаяДата()) Тогда 
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры
